{
    "featuredTrails": [
        {
            "name": "Kedarnath",
            "slug": "kedarnath",
            "location": "Uttarakhand",
            "image": "kedarnath.jpg",
            "summary": "Pilgrimage trek to Kedarnath Temple.",
            "detail": "The Kedarnath trek is a spiritually uplifting trail that takes you to one of the holiest shrines in India — the Kedarnath Temple. Located at 11,755 feet, the temple stands amid the dramatic backdrop of snow-covered peaks and the Mandakini River. The 16 km trek from Gaurikund is steep yet scenic, with a mix of pine forests, waterfalls, and open meadows. It’s best attempted between May and October when weather conditions are favorable.",
            "difficulty": "Moderate",
            "duration": "2 Days (16 km trek)",
            "season": "May – October",
            "link": "/trails/kedarnath"
        },
        {
            "name": "Madhyamaheshwar",
            "slug": "madhyamaheshwar",
            "location": "Uttarakhand",
            "image": "madhyamaheshwar.jpg",
            "summary": "Remote Shiva temple with lush valley views.",
            "detail": "A scenic trek through dense forests leading to a high-altitude temple in a serene meadow setting. The trail offers panoramic views of the Chaukhamba peaks and is ideal for those seeking solitude and spiritual connection.",
            "difficulty": "Moderate",
            "duration": "3 Days (~32 km total)",
            "season": "May – October",
            "link": "/trails/madhyamaheshwar"
        },
        {
            "name": "Tungnath & Chandrashila",
            "slug": "tungnath",
            "location": "Uttarakhand",
            "image": "tungnath.jpg",
            "summary": "Highest Shiva temple trek with Himalayan views.",
            "detail": "The trek to Tungnath and Chandrashila offers a spiritual and scenic journey through the Garhwal Himalayas. Starting from Chopta, this moderate trail winds through dense forests and alpine meadows before reaching Tungnath — the world’s highest Shiva temple. A further ascent to Chandrashila summit rewards trekkers with a breathtaking panoramic view of snow-capped Himalayan peaks including Nanda Devi, Trishul, and Kedarnath. This trek is ideal for beginners and nature lovers.",
            "difficulty": "Moderate",
            "duration": "2 Days (~10 km total)",
            "season": "April – November",
            "link": "/trails/tungnath"
        },
        {
            "name": "Rudranath",
            "slug": "rudranath",
            "location": "Uttarakhand",
            "image": "rudranath.jpg",
            "summary": "Tough trail to a cave temple in alpine surroundings.",
            "detail": "Remote and mystical trail that rewards with deep forests, grassy meadows, and panoramic views. The temple is situated in a natural cave amidst rhododendron forests and alpine pastures.",
            "difficulty": "Difficult",
            "duration": "4–5 Days (~20 km)",
            "season": "June – September",
            "link": "/trails/rudranath"
        },
        {
            "name": "Kalpnath",
            "slug": "kalpnath",
            "location": "Uttarakhand",
            "image": "kalpnath.jpg",
            "summary": "Hidden shrine accessed via cave path.",
            "detail": "A short hike and a cave-like entrance make this an adventurous visit among the Panch Kedar. The temple is dedicated to Lord Shiva and is known for its unique rock formations.",
            "difficulty": "Easy",
            "duration": "1 Day (~2–3 km)",
            "season": "May – October",
            "link": "/trails/kalpnath"
        },
        {
            "name": "Badrinath – Valley of Devotion",
            "slug": "badrinath",
            "location": "Uttarakhand",
            "image": "badrinath.jpg",
            "summary": "A sacred journey to a revered Himalayan temple.",
            "detail": "Badrinath, one of the Char Dham pilgrimage sites, is nestled in the Nar-Narayan mountain ranges beside the Alaknanda River. This spiritual destination attracts thousands each year with its divine aura, natural beauty, and the iconic Badrinath Temple dedicated to Lord Vishnu. While most of the route is motorable, short nature walks around the area reveal hot springs, peaceful riverside ghats, and snow-capped views. Whether for devotion or exploration, Badrinath offers an unforgettable blend of faith and serenity.",
            "difficulty": "Easy",
            "duration": "1–2 Days (motorable with short walks)",
            "season": "May – October",
            "link": "/trails/badrinath"
        },
        {
            "name": "Adi Badri",
            "slug": "adi-badri",
            "location": "Uttarakhand",
            "image": "adi-badri.jpg",
            "summary": "Cluster of 16 ancient shrines near Karnaprayag.",
            "detail": "These old temples are attributed to Adi Shankaracharya, nestled in a tranquil forested setting. The site offers a serene atmosphere and is an important part of the Sapta Badri pilgrimage.",
            "difficulty": "Easy",
            "duration": "1 Day",
            "season": "All year",
            "link": "/trails/adi-badri"
        },
        {
            "name": "Bhavishya Badri",
            "slug": "bhavishya-badri",
            "location": "Uttarakhand",
            "image": "bhavishya-badri.jpg",
            "summary": "Future shrine where Badrinath will manifest.",
            "detail": "Mythologically important, this secluded spot is said to be the future site of Vishnu’s worship. The trek to Bhavishya Badri passes through dense forests and offers a peaceful retreat.",
            "difficulty": "Moderate",
            "duration": "2 Days (~6 km)",
            "season": "April – November",
            "link": "/trails/bhavishya-badri"
        },
        {
            "name": "Yogadhyan Badri",
            "slug": "yogadhyan-badri",
            "location": "Uttarakhand",
            "image": "yogadhyan-badri.jpg",
            "summary": "Idol meditating in yoga posture.",
            "detail": "Located in Pandukeshwar, it is believed to be the place where Pandu meditated on Lord Vishnu. The temple is known for its serene environment and spiritual significance.",
            "difficulty": "Easy",
            "duration": "1 Day",
            "season": "All year",
            "link": "/trails/yogadhyan-badri"
        },
        {
            "name": "Vriddha Badri",
            "slug": "vriddha-badri",
            "location": "Uttarakhand",
            "image": "vriddha-badri.jpg",
            "summary": "Ancient temple of the old Badrinath idol.",
            "detail": "The idol here is believed to be the original one worshipped before Badrinath temple was established. The temple is situated in Animath village and offers a quiet retreat.",
            "difficulty": "Easy",
            "duration": "1 Day",
            "season": "All year",
            "link": "/trails/vriddha-badri"
        },
        {
            "name": "Ardha Badri",
            "slug": "ardha-badri",
            "location": "Uttarakhand",
            "image": "ardha-badri.jpg",
            "summary": "Small shrine with half-sized Vishnu idol.",
            "detail": "This little-known temple has a unique half-sized idol of Lord Vishnu. It is less frequented, offering a peaceful environment for devotees.",
            "difficulty": "Easy",
            "duration": "1 Day",
            "season": "All year",
            "link": "/trails/ardha-badri"
        },
        {
            "name": "Dhyan Badri",
            "slug": "dhyan-badri",
            "location": "Uttarakhand",
            "image": "dhyan-badri.jpg",
            "summary": "Linked to meditative practices of Vishnu.",
            "detail": "Located in Urgam Valley, this temple emphasizes introspection and spiritual retreat. The surrounding area is known for its natural beauty and tranquility.",
            "difficulty": "Moderate",
            "duration": "1–2 Days",
            "season": "April – November",
            "link": "/trails/dhyan-badri"
        },
        {
            "name": "Swargrohini Trek",
            "slug": "swargrohini",
            "location": "Uttarakhand",
            "image": "swargrohini.jpg",
            "summary": "Mythical path to heaven through glacial valleys.",
            "detail": "The Swargrohini Trek is steeped in mythology, believed to be the path taken by the Pandavas to ascend to heaven. The trail offers challenging terrains, glacial valleys, and panoramic views of the Swargarohini peaks.",
            "difficulty": "Difficult",
            "duration": "7–8 Days (~60 km total)",
            "season": "June – September",
            "link": "/trails/swargrohini"
        },
        {
            "name": "Viratnagar Chronicles",
            "slug": "viratnagar-chronicles",
            "location": "Rajasthan",
            "image": "viratnagar.jpg",
            "summary": "Explore ancient Buddhist caves, Ashokan edicts, and legends of the Mahabharata.",
            "detail": "Viratnagar, believed to be the ancient capital of the Matsya kingdom, is rich with archaeological and mythological significance. The region houses ancient Buddhist caves, a 3rd century BCE Ashokan edict, and remnants from the Mauryan and Gupta periods. According to legend, the Pandavas spent a year of exile here. Visitors can explore the Bijak Pahadi rock shelter, ancient stupas, and nature trails across the Aravalli hills. Ideal for history buffs, trekkers, and cultural enthusiasts.",
            "difficulty": "Easy",
            "duration": "1 Day",
            "season": "October – March",
            "link": "/trails/viratnagar-chronicles"
        },
        {
            "name": "Sambhar Circuit",
            "slug": "sambhar-circuit",
            "location": "Rajasthan",
            "image": "sambhar-lake.jpg",
            "summary": "A surreal salt lake experience with birdwatching and heritage trails.",
            "detail": "Sambhar Salt Lake is India’s largest inland saltwater lake and a surreal destination for explorers and photographers. The circuit offers panoramic views of the vast white landscape, centuries-old salt production systems, and colonial-era railway lines. Birdwatchers flock here during winter to spot flamingos, storks, and other migratory species. Explore the Shakambari Devi Temple, local museums, and rustic Rajasthani villages nearby. A perfect blend of nature, culture, and heritage.",
            "difficulty": "Easy",
            "duration": "1–2 Days",
            "season": "October – March",
            "link": "/trails/sambhar-circuit"
        },
        {
            "name": "Amber Heritage Walk",
            "slug": "amber-heritage-walk",
            "location": "Jaipur, Rajasthan",
            "image": "amber-walk.jpg",
            "summary": "Step into the royal past of Amber with this curated walking trail.",
            "detail": "The Amber Heritage Walk takes you through the living town of Amber, beyond the grand Amber Fort. Discover hidden temples, ancient stepwells, havelis, and community spaces nestled in narrow alleys. Learn about the architecture, local traditions, and daily life of residents in this historic settlement. This immersive walk is ideal for cultural travelers and history lovers looking for a more intimate view of Rajasthan’s heritage.",
            "difficulty": "Easy",
            "duration": "2–3 Hours",
            "season": "October – March",
            "link": "/trails/amber-heritage-walk"
        },
        {
            "name": "Jaipur City Heritage Walk",
            "slug": "jaipur-city-heritage-walk",
            "location": "Jaipur, Rajasthan",
            "image": "jaipur-walk.jpg",
            "summary": "A cultural immersion into Jaipur’s Pink City lanes and landmarks.",
            "detail": "This guided walk through Jaipur’s old city reveals the soul of the Pink City. Wander through bustling bazaars, artisan quarters, and iconic architectural marvels like Hawa Mahal and City Palace. Engage with local craftspeople, sample street food, and explore hidden temples and courtyards. Perfect for those looking to understand Jaipur’s living culture, art, and urban planning up close.",
            "difficulty": "Easy",
            "duration": "2–3 Hours",
            "season": "October – March",
            "link": "/trails/jaipur-heritage-walk"
        },
        {
            "name": "Museums of Jaipur",
            "slug": "jaipur-museums",
            "location": "Jaipur, Rajasthan",
            "image": "jaipur-museums.jpg",
            "summary": "Explore Jaipur’s regal history and artistic treasures through its museums.",
            "detail": "Jaipur offers a rich array of museums showcasing royal artifacts, textiles, arms, manuscripts, and art. Key highlights include the Albert Hall Museum, City Palace Museum, Anokhi Museum of Hand Printing, and Dolls Museum. Each space reflects the city's legacy of craftsmanship, trade, and culture. Ideal for history enthusiasts, art lovers, and families.",
            "difficulty": "Very Easy",
            "duration": "1–2 Days",
            "season": "Year-round",
            "link": "/trails/jaipur-museums"
        },
        {
            "name": "Forts of Jaipur",
            "slug": "jaipur-forts",
            "location": "Jaipur, Rajasthan",
            "image": "jaipur-forts.jpg",
            "summary": "Discover the majestic forts that shaped Jaipur’s regal history.",
            "detail": "Jaipur's hill forts — Amber Fort, Jaigarh Fort, and Nahargarh Fort — stand as imposing reminders of Rajput valor and architectural brilliance. Each fort offers stunning views of the Aravalli hills and Jaipur city, as well as stories of royal strategy, defense systems, and palatial design. Some even feature evening sound-and-light shows and cafés with panoramic backdrops. Ideal for photographers, history buffs, and adventure seekers.",
            "difficulty": "Easy to Moderate",
            "duration": "1–2 Days",
            "season": "October – March",
            "link": "/trails/jaipur-forts"
        },
        {
            "name": "Temples of Jaipur",
            "slug": "temples-of-jaipur",
            "location": "Jaipur, Rajasthan",
            "image": "jaipur-temples.jpg",
            "summary": "A spiritual walk through Jaipur’s revered and historic temples.",
            "detail": "Explore the spiritual core of Jaipur through a circuit of its renowned temples including Govind Dev Ji Temple, Galta Ji (Monkey Temple), Birla Mandir, and Moti Dungri. These temples reflect a confluence of architectural styles and deep-rooted faith. The trail also includes peaceful walks along forested temple paths and sacred tanks. Ideal for spiritual travelers, photographers, and architecture lovers.",
            "difficulty": "Easy",
            "duration": "1 Day",
            "season": "Year-round",
            "link": "/trails/jaipur-temples"
        },
        {
            "name": "Sariska Circuit",
            "slug": "sariska-circuit",
            "location": "Alwar, Rajasthan",
            "image": "sariska.jpg",
            "summary": "Wildlife, forts, and temples around the Sariska Tiger Reserve.",
            "detail": "The Sariska Circuit offers a diverse blend of wildlife safaris, ancient temples, and ruined palaces in and around the Sariska Tiger Reserve. Key stops include Pandupol Hanuman Temple, Kankwari Fort, Siliserh Lake, and Alwar City Palace. Safaris offer chances to spot tigers, leopards, and antelope. This trail is great for families, wildlife lovers, and road trippers looking for a weekend escape from Delhi or Jaipur.",
            "difficulty": "Easy",
            "duration": "2–3 Days",
            "season": "October – March",
            "link": "/trails/sariska-circuit"
        },
        {
            "name": "Dausa Circuit (Abhaneri, Ajabgarh, Bhangarh)",
            "slug": "dausa-circuit",
            "location": "Dausa, Rajasthan",
            "image": "dausa-circuit.jpg",
            "summary": "A mystical trail through stepwells, forts, and haunted ruins.",
            "detail": "This offbeat circuit in Rajasthan includes the stunning Chand Baori stepwell at Abhaneri, the mysterious ruins of Bhangarh Fort — considered one of India’s most haunted places — and the scenic Ajabgarh Fort. The trail blends ancient engineering, legends, and heritage walks through semi-arid landscapes. Great for photographers, history fans, and thrill-seekers looking for lesser-known destinations.",
            "difficulty": "Easy",
            "duration": "1–2 Days",
            "season": "October – March",
            "link": "/trails/dausa-circuit"
        }
    ]
}